{
	"format": "layers-model",
	"generatedBy": "keras v2.2.5",
	"convertedBy": "TensorFlow.js Converter v1.3.2",
	"modelTopology": {
		"keras_version": "2.2.5",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential_2",
				"layers": [
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_4",
							"trainable": true,
							"batch_input_shape": [ null, 200, 200, 1 ],
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [ 3, 3 ],
							"strides": [ 1, 1 ],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [ 1, 1 ],
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_5",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						}
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_4",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [ 2, 2 ],
							"padding": "valid",
							"strides": [ 2, 2 ],
							"data_format": "channels_last"
						}
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_5",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [ 3, 3 ],
							"strides": [ 1, 1 ],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [ 1, 1 ],
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_6",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						}
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_5",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [ 2, 2 ],
							"padding": "valid",
							"strides": [ 2, 2 ],
							"data_format": "channels_last"
						}
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_6",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [ 3, 3 ],
							"strides": [ 1, 1 ],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [ 1, 1 ],
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_7",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						}
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_6",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [ 2, 2 ],
							"padding": "valid",
							"strides": [ 2, 2 ],
							"data_format": "channels_last"
						}
					},
					{
						"class_name": "Flatten",
						"config": {
							"name": "flatten_2",
							"trainable": true,
							"dtype": "float32",
							"data_format": "channels_last"
						}
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_2",
							"trainable": true,
							"dtype": "float32",
							"rate": 0.5,
							"noise_shape": null,
							"seed": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_3",
							"trainable": true,
							"dtype": "float32",
							"units": 512,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_4",
							"trainable": true,
							"dtype": "float32",
							"units": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_8",
							"trainable": true,
							"dtype": "float32",
							"activation": "sigmoid"
						}
					}
				]
			}
		},
		"training_config": {
			"optimizer_config": {
				"class_name": "Adam",
				"config": {
					"lr": 0.0010000000474974513,
					"beta_1": 0.8999999761581421,
					"beta_2": 0.9990000128746033,
					"decay": 0.0,
					"epsilon": 1e-7,
					"amsgrad": false
				}
			},
			"loss": "sparse_categorical_crossentropy",
			"metrics": [ "accuracy" ],
			"weighted_metrics": null,
			"sample_weight_mode": null,
			"loss_weights": null
		}
	},
	"weightsManifest": [
		{
			"paths": [
				"group1-shard1of34.bin",
				"group1-shard2of34.bin",
				"group1-shard3of34.bin",
				"group1-shard4of34.bin",
				"group1-shard5of34.bin",
				"group1-shard6of34.bin",
				"group1-shard7of34.bin",
				"group1-shard8of34.bin",
				"group1-shard9of34.bin",
				"group1-shard10of34.bin",
				"group1-shard11of34.bin",
				"group1-shard12of34.bin",
				"group1-shard13of34.bin",
				"group1-shard14of34.bin",
				"group1-shard15of34.bin",
				"group1-shard16of34.bin",
				"group1-shard17of34.bin",
				"group1-shard18of34.bin",
				"group1-shard19of34.bin",
				"group1-shard20of34.bin",
				"group1-shard21of34.bin",
				"group1-shard22of34.bin",
				"group1-shard23of34.bin",
				"group1-shard24of34.bin",
				"group1-shard25of34.bin",
				"group1-shard26of34.bin",
				"group1-shard27of34.bin",
				"group1-shard28of34.bin",
				"group1-shard29of34.bin",
				"group1-shard30of34.bin",
				"group1-shard31of34.bin",
				"group1-shard32of34.bin",
				"group1-shard33of34.bin",
				"group1-shard34of34.bin"
			],
			"weights": [
				{ "name": "conv2d_4/kernel", "shape": [ 3, 3, 1, 64 ], "dtype": "float32" },
				{ "name": "conv2d_4/bias", "shape": [ 64 ], "dtype": "float32" },
				{ "name": "conv2d_5/kernel", "shape": [ 3, 3, 64, 64 ], "dtype": "float32" },
				{ "name": "conv2d_5/bias", "shape": [ 64 ], "dtype": "float32" },
				{ "name": "conv2d_6/kernel", "shape": [ 3, 3, 64, 128 ], "dtype": "float32" },
				{ "name": "conv2d_6/bias", "shape": [ 128 ], "dtype": "float32" },
				{ "name": "dense_3/kernel", "shape": [ 67712, 512 ], "dtype": "float32" },
				{ "name": "dense_3/bias", "shape": [ 512 ], "dtype": "float32" },
				{ "name": "dense_4/kernel", "shape": [ 512, 1 ], "dtype": "float32" },
				{ "name": "dense_4/bias", "shape": [ 1 ], "dtype": "float32" }
			]
		}
	]
}
